In [9]:
import warnings
warnings.filterwarnings(action='ignore')

In [11]:
import pandas as pd

In [21]:
list=[1,2,3,4,5]
pd_s1=pd.DataFrame(list)
pd_s1

   0
0  1
1  2
2  3
3  4
4  5

In [23]:
pd_s1['1열'] = list
pd_s1

   0  1열
0  1   1
1  2   2
2  3   3
3  4   4
4  5   5

In [27]:
pd_s1.columns

Index([0, '1열'], dtype='object')

In [31]:
pd_s2 = pd_s1.rename(columns={0:'0열'})
pd_s2

   0열  1열
0   1   1
1   2   2
2   3   3
3   4   4
4   5   5

In [91]:
#2차원배열
score=[['정약용',70,80,100],
       ['이순신',100,80,70],
       ['이율곡',90,95,90]]
print(type(score))
score

<class 'list'>

[['정약용', 70, 80, 100], ['이순신', 100, 80, 70], ['이율곡', 90, 95, 90]]

In [93]:
score_df=pd.DataFrame(score)
print(type(score_df))
score_df

<class 'pandas.core.frame.DataFrame'>

     0    1   2    3
0  정약용   70  80  100
1  이순신  100  80   70
2  이율곡   90  95   90

In [95]:
score_df.columns = ["이름","국어","영어","수학"]
score_df

    이름   국어  영어   수학
0  정약용   70  80  100
1  이순신  100  80   70
2  이율곡   90  95   90

In [43]:
score_df.shape

(3, 4)

In [45]:
score_df.index

RangeIndex(start=0, stop=3, step=1)

In [47]:
score_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      3 non-null      object
 1   국어      3 non-null      int64
 2   영어      3 non-null      int64
 3   수학      3 non-null      int64
dtypes: int64(3), object(1)
memory usage: 228.0+ bytes

In [115]:
n=pd.DataFrame({'col_str1':['1', '2', '3', '4'],
                'col_str2':['5', '6', '7', '8']})
print(n)
n.dtypes

  col_str1 col_str2
0        1        5
1        2        6
2        3        7
3        4        8

col_str1    object
col_str2    object
dtype: object

In [117]:
n_df=n.astype({'col_str1':int, 'col_str2':float})  # 데이터 타입 변경
print(n_df)
n_df.dtypes

   col_str1  col_str2
0         1       5.0
1         2       6.0
2         3       7.0
3         4       8.0

col_str1      int32
col_str2    float64
dtype: object

In [97]:
score_df.columns=['성명', 'kor', 'eng', 'mat']
score_df

    성명  kor  eng  mat
0  정약용   70   80  100
1  이순신  100   80   70
2  이율곡   90   95   90

In [99]:
score_df.index = score_df['성명']   ## 인덱스를 "성명"항목으로 변경
score_df

      성명  kor  eng  mat
성명
정약용  정약용   70   80  100
이순신  이순신  100   80   70
이율곡  이율곡   90   95   90

In [101]:
score_df.drop(['성명'], axis=1 , inplace=True)

In [103]:
score_df

     kor  eng  mat
성명
정약용   70   80  100
이순신  100   80   70
이율곡   90   95   90

In [105]:
score_df.drop(['이순신'],axis=0)

     kor  eng  mat
성명
정약용   70   80  100
이율곡   90   95   90

In [107]:
score_df

     kor  eng  mat
성명
정약용   70   80  100
이순신  100   80   70
이율곡   90   95   90

In [109]:
x=[0, 1, 2, 3, 4, 5]
y=[0, 2, 4, 6, 8, 10]
df=pd.DataFrame( )
df['x_value']=x
df['y_value']=y
df

   x_value  y_value
0        0        0
1        1        2
2        2        4
3        3        6
4        4        8
5        5       10

In [113]:
df['xy_value']=df['x_value'] + df['y_value']
df

   x_value  y_value  xy_value
0        0        0         0
1        1        2         3
2        2        4         6
3        3        6         9
4        4        8        12
5        5       10        15